%S1 
%Vx导数
if t == 0 || t >= 12.247 || tao > 74  %状态变量的导数在起点和终点不可导，需要特殊处理(水平方向匀减速运动)
    accelerate_vx = -1.4289; 
else
    accelerate_vx = -v_tran / t_tran * sin(pi * t / t_tran) / (sqrt(1-(2 * tao / taov0 - 1)^2));
end
p1 = 7.7191e-08; p2 = 6.8331e-06; p3 = -0.00018488; p4 = 0.0012743; p5 = -0.0034819; p6 = 0.02417;
accelerate_theta = 6 * p1 * t^5 + 5 * p2 * t^4 + 4 * p3 * t^3 + 3 * p4 * t^2 + 2 * p5 * t + p6; %第二阶段配平，指定对theta导数的要求
%二阶段theta轨迹
p1 = 7.7191e-08; p2 = 6.8331e-06; p3 = -0.00018488; p4 = 0.0012743; p5 = -0.0034819; p6 = 0.02417; p7 = 0.044811;
theta_refer = p1 * t^6 + p2 * t^5 +  p3 * t^4 + p4 * t^3 + p5 * t^2 + p6 * t + p7;


%S2 Vx导数
if t == 0 || t >= 12.247 || tao > 75  %状态变量的导数在起点和终点不可导，需要特殊处理(水平方向匀减速运动)
   accelerate_vx = 0;
else
    p1 = -2.2209e-18; p2 = -7.3467e-05; p3 = 0.0022494; p4 = -0.0030648; p5 = -0.28111; p6 = -0.005942;
    accelerate_vx = 6 * p1 * t^5 + 5 * p2 * t^4 + 4 * p3 * t^3 + 3 * p4 * t^2 + 2 * p5 * t + p6;
end
p1 = 3.3588e-06; p2 = -8.5021e-05; p3 = 0.0005768; p4 = -0.00049029; p5 = -0.0010235; p6 = 0.010243;  %S2
accelerate_theta = 6 * p1 * t^5 + 5 * p2 * t^4 + 4 * p3 * t^3 + 3 * p4 * t^2 + 2 * p5 * t + p6; %第二阶段配平，指定对theta导数的要求

%S3
if t > t_tran || tao > taov0  %状态变量的导数在起点和终点不可导，需要特殊处理(水平方向匀减速运动)
   accelerate_vx = 0;
else
    p1 = -2.772e-06;p2 = 0.00014995;p3 = -0.0033312;p4 = 0.039396;p5 = -0.26909;p6 = 1.0752;p7 = -2.4117;p8 = 2.6491;p9 = -1.1524;
    accelerate_vx = 9 * p1 * t^8 + 8 * p2 * t^7 + 7 * p3 * t^6 + 6 * p4 * t^5 + 5 * p5 * t^4 + 4 * p6 * t^3 + 3 * p7 * t^2 + 2 * p8 * t + p9;
end